In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('Mumbai.csv')

In [3]:
data.head()

,bhk,type,locality,area,price,price_unit,region,status,age
0,3,Apartment,Lak And Hanware The Residency Tower,685,2.50,Cr,Andheri West,Ready to move,New
1,2,Apartment,Radheya Sai Enclave Building No 2,640,52.51,L,Naigaon East,Under Construction,New
2,2,Apartment,Romell Serene,610,1.73,Cr,Borivali West,Under Construction,New
3,2,Apartment,Soundlines Codename Urban Rainforest,876,59.98,L,Panvel,Under Construction,New
4,2,Apartment,Origin Oriana,659,94.11,L,Mira Road East,Under Construction,New

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 76038 entries, 0 to 76037
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bhk         76038 non-null  int64
 1   type        76038 non-null  object
 2   locality    76038 non-null  object
 3   area        76038 non-null  int64
 4   price       76038 non-null  float64
 5   price_unit  76038 non-null  object
 6   region      76038 non-null  object
 7   status      76038 non-null  object
 8   age         76038 non-null  object
dtypes: float64(1), int64(2), object(6)
memory usage: 5.2+ MB

In [5]:
for column in data.columns:
    print(data[column].value_counts())
    print("*"*20)

2     31429
1     24613
3     15273
4      3934
5       606
6       148
7        16
8         8
10        6
9         5
Name: bhk, dtype: int64
********************
Apartment            74854
Studio Apartment       882
Villa                  226
Independent House       73
Penthouse                3
Name: type, dtype: int64
********************
Hiranandani Meadows                    861
Sheth Avalon                           516
T Bhimjyani The Verraton               499
ACME Ozone Phase 2                     467
Runwal Gardens                         389
                                      ...
HP Anton CHSL Rishab Anton               1
Reputed Builder Shankar Heritage         1
Reputed Builder Aishwarya Apartment      1
Reputed Builder Vinit Tower              1
Hubtown Serene                           1
Name: locality, Length: 9782, dtype: int64
********************
650     1662
1050    1381
1100    1151
1650    1041
750      950
        ...
2369       1
1945       1
1442       1
2672       1
3049       1
Name: area, Length: 2331, dtype: int64
********************
1.75     972
1.25     948
1.35     854
1.15     846
1.10     839
        ...
27.47      1
29.11      1
71.84      1
56.68      1
4.38       1
Name: price, Length: 4729, dtype: int64
********************
Cr    40981
L     35057
Name: price_unit, dtype: int64
********************
Thane West         14868
Mira Road East      9902
Dombivali           3041
Kandivali East      2568
Kharghar            2362
                   ...
Police Colony          1
GTB Nagar              1
Bandra                 1
Sector 14 Vashi        1
Goregaon               1
Name: region, Length: 228, dtype: int64
********************
Ready to move         44982
Under Construction    31056
Name: status, dtype: int64
********************
New        38072
Resale     23357
Unknown    14609
Name: age, dtype: int64
********************

In [6]:
data.isna().sum()

bhk           0
type          0
locality      0
area          0
price         0
price_unit    0
region        0
status        0
age           0
dtype: int64

In [8]:
data.describe()

                bhk          area        price
count  76038.000000  76038.000000  76038.00000
mean       2.015111   1024.536850     29.38227
std        0.922754    670.276165     32.90345
min        1.000000    127.000000      1.00000
25%        1.000000    640.000000      1.75000
50%        2.000000    872.000000      5.50000
75%        3.000000   1179.000000     59.00000
max       10.000000  16000.000000     99.99000

In [11]:
data['region'].value_counts()

Thane West         14868
Mira Road East      9902
Dombivali           3041
Kandivali East      2568
Kharghar            2362
                   ...
Police Colony          1
GTB Nagar              1
Bandra                 1
Sector 14 Vashi        1
Goregaon               1
Name: region, Length: 228, dtype: int64

In [ ]:
data['region'] = data['region'].fillna('Goregaon')

In [12]:
data['bhk'].value_counts()

2     31429
1     24613
3     15273
4      3934
5       606
6       148
7        16
8         8
10        6
9         5
Name: bhk, dtype: int64

In [14]:
data['bhk'] = data['bhk'].fillna('2')

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 76038 entries, 0 to 76037
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bhk         76038 non-null  int64
 1   type        76038 non-null  object
 2   locality    76038 non-null  object
 3   area        76038 non-null  int64
 4   price       76038 non-null  float64
 5   price_unit  76038 non-null  object
 6   region      76038 non-null  object
 7   status      76038 non-null  object
 8   age         76038 non-null  object
dtypes: float64(1), int64(2), object(6)
memory usage: 5.2+ MB

In [16]:
data[data.bhk > 9]

,bhk,type,locality,area,price,price_unit,region,status,age
8454,10,Apartment,Reputed Builder Varsha Apartments,6200,33.0,Cr,Juhu,Ready to move,Resale
8455,10,Apartment,Reputed Builder Avighna,6500,35.0,Cr,Chembur,Ready to move,Resale
45473,10,Apartment,Rustomjee Crown Phase 1,7500,41.0,Cr,Prabhadevi,Ready to move,New
60864,10,Apartment,JP Chalet Amar,16000,50.0,Cr,Juhu,Ready to move,Unknown
68538,10,Apartment,Indiabulls Blu Tower D,16000,40.0,Cr,Worli,Ready to move,Unknown
68539,10,Apartment,Sunteck Signature Island,16000,50.0,Cr,Bandra Kurla Complex,Ready to move,Unknown

In [17]:
data['area'].unique()

array([ 685,  640,  610, ..., 1974, 1634, 3049], dtype=int64)